RockBase-iot/esp-claw/application/basic_demo/boards/nm_cyd_c5/sdkconfig.defaults.board
# Board specific defaults for NM-CYD-C5 (ESP32-C5, 16 MB flash, 8 MB PSRAM).
# ESP32-C5 is a single-core RISC-V chip, so the dual-core / OPI PSRAM options
# used by the ESP32-S3 boards do not apply here.

CONFIG_IDF_TARGET="esp32c5"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# 16 MB flash @ DIO 80 MHz (NM-CYD-C5 ESP32-C5-WROOM-1)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 8 MB PSRAM via the SPI / quad interface (ESP32-C5 has no octal mode)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TYPE_AUTO=y
